In [1]:
import pandas as pd
import pandasql
#we use pandasql to type SQL commands on a pandas dataframe!

In [5]:
#загрузим датасет, по умолчанию как раз подгрузится нужный нам 1 лист mortgage
bank = pd.read_excel('data/bank_account_data.xlsx')

In [6]:
# проверим загрузку датасета
bank.head(5)

   Cust_ID  Purchase  Cheq_Bal   Sav_Bal  Debt_Bal  Joint_Acct  Age       Date
0        1         0   1739.48  26918.18  12563.93           0   49        NaT
1        2         0   2862.35  23093.67  15457.88           0   39        NaT
2        3         0   2296.66  18037.33  12721.89           0   52        NaT
3        4         1   2880.28  32317.63   7075.03           0   28 2017-04-30
4        5         0    998.27  15110.04  11356.13           0   43        NaT

### 1. Опишите имеющиеся колонки в данных - сделайте аналог describe в pandas для колонок.

In [7]:
# используем агрегирующие функции для каждой колонки
Cust_ID = pandasql.sqldf("SELECT SUM(Cust_ID), AVG(Cust_ID), COUNT(Cust_ID), MIN (Cust_ID), MAX(Cust_ID) FROM bank;")
Purchase = pandasql.sqldf("SELECT SUM(Purchase), AVG(Purchase), COUNT(Purchase), MIN (Purchase),MAX(Purchase) FROM bank;")
Cheq_Bal = pandasql.sqldf("SELECT SUM(Cheq_Bal), AVG(Cheq_Bal), COUNT(Cheq_Bal), MIN (Cheq_Bal), MAX(Cheq_Bal) FROM bank;")
Sav_Bal= pandasql.sqldf("SELECT SUM(Sav_Bal), AVG(Sav_Bal), COUNT(Sav_Bal), MIN (Sav_Bal), MAX(Sav_Bal) FROM bank;")
Debt_Bal = pandasql.sqldf("SELECT SUM(Debt_Bal), AVG(Debt_Bal), COUNT(Debt_Bal), MIN (Debt_Bal), MAX(Debt_Bal) FROM bank;")
Joint_Acct = pandasql.sqldf("SELECT SUM(Joint_Acct), AVG(Joint_Acct), COUNT(Joint_Acct), MIN (Joint_Acct), MAX(Joint_Acct) FROM bank;")
Age = pandasql.sqldf("SELECT SUM(Age), AVG(Age), COUNT(Age), MIN (Age), MAX(Age) FROM bank;")
Date = pandasql.sqldf("SELECT SUM(Date), AVG(Date), COUNT(Date), MIN (Date), MAX(Date) FROM bank;")

In [8]:
# выведем полученные результаты
print(Cust_ID, Purchase, Cheq_Bal, Sav_Bal, 
      Debt_Bal, Joint_Acct, Age, Date, sep='\n\n')

   SUM(Cust_ID)  AVG(Cust_ID)  COUNT(Cust_ID)  MIN (Cust_ID)  MAX(Cust_ID)
0         20100         100.5             200              1           200

   SUM(Purchase)  AVG(Purchase)  COUNT(Purchase)  MIN (Purchase)  \
0             39          0.195              200               0

   MAX(Purchase)
0              1

   SUM(Cheq_Bal)  AVG(Cheq_Bal)  COUNT(Cheq_Bal)  MIN (Cheq_Bal)  \
0       429018.7      2145.0935              200          644.31

   MAX(Cheq_Bal)
0        4437.44

   SUM(Sav_Bal)  AVG(Sav_Bal)  COUNT(Sav_Bal)  MIN (Sav_Bal)  MAX(Sav_Bal)
0    4416885.79   22084.42895             200        6558.91      39132.63

   SUM(Debt_Bal)  AVG(Debt_Bal)  COUNT(Debt_Bal)  MIN (Debt_Bal)  \
0     1727673.92      8638.3696              200             0.0

   MAX(Debt_Bal)
0        20559.7

   SUM(Joint_Acct)  AVG(Joint_Acct)  COUNT(Joint_Acct)  MIN (Joint_Acct)  \
0               59            0.295                200                 0

   MAX(Joint_Acct)
0                1

   SUM(Age)  AVG(Age)  COUNT(Age)  MIN (Age)  MAX(Age)
0      7707    38.535         200         18        60

   SUM(Date)  AVG(Date)  COUNT(Date)                  MIN (Date)  \
0    78663.0     2017.0           39  2017-04-01 00:00:00.000000

                    MAX(Date)
0  2017-08-29 00:00:00.000000

In [9]:
# 1 колонка содершит уникальные id, 2 и 6 колонка категориальные и содержат всего 2 значения, 
# 3-5 колонки содержат данные о разлчиных видах счетов, 6 колонка показывает данные возраста, 
#7 колонка содержит временные данные, выбросов и отклонений на первый взгляд не видно, есть пропуски в колонке Date

### 2. Посчитайте совокупный объем средств у клиентов в банке - сумма по всем балансам с группировкой по id клиента

In [10]:
total_Bal = pandasql.sqldf("SELECT Cust_ID, SUM(Sav_Bal+Cheq_Bal+Debt_Bal) AS total_bal FROM bank GROUP BY 1;")
print(total_Bal)

     Cust_ID  total_bal
0          1   41221.59
1          2   41413.90
2          3   33055.88
3          4   42272.94
4          5   27464.44
..       ...        ...
195      196   33573.27
196      197   32763.17
197      198   36788.96
198      199   26379.16
199      200   32372.60

[200 rows x 2 columns]

### 3. Выведите только тех клиентов, которые приобрели ипотеку (колонка purchase)

In [11]:
mortgage = pandasql.sqldf("SELECT Cust_ID FROM bank WHERE purchase = 1;")
print(mortgage)

    Cust_ID
0         4
1         6
2         7
3        11
4        13
5        17
6        18
7        20
8        22
9        31
10       36
11       38
12       40
13       41
14       54
15       56
16       59
17       60
18       74
19       76
20       80
21       87
22       91
23       93
24       94
25       97
26      100
27      107
28      111
29      113
30      132
31      146
32      154
33      166
34      169
35      182
36      184
37      185
38      189

### 4. Какой совокупный объем средств в среднем у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?

In [12]:
total_morgage = pandasql.sqldf("SELECT AVG(Sav_Bal+Cheq_Bal+Debt_Bal) AS avg_balance FROM bank GROUP BY purchase;")
print(total_morgage)

    avg_balance
0  32095.885031
1  36054.895385

У клиентов, которые приобрели ипотеку в среднем средств чуть больше на балансе

### 5. Есть ли разница в среднем по каждому из типов баланса у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?

In [13]:
avg_morgage = pandasql.sqldf("SELECT AVG(Sav_Bal), AVG(Cheq_Bal), AVG(Debt_Bal) FROM bank GROUP BY purchase;")
print(avg_morgage)

   AVG(Sav_Bal)  AVG(Cheq_Bal)  AVG(Debt_Bal)
0  20257.209814    1996.631366    9842.043851
1  29627.564359    2757.975641    3669.355385

У клиентов, которые приобрели ипотеку в среднем средств чуть больше на первых 2 видах баланса, 
которые видимо используются в большей степени для оплаты ипотеки

### 6. Выберите самого возрастного получателя ипотеки.

In [14]:
old_id = pandasql.sqldf("SELECT Cust_ID, MAX(Age) FROM bank;")
print(old_id)

   Cust_ID  MAX(Age)
0       34        60

### 7. Выберите клиента, который раньше всех получил ипотеку.

In [15]:
first_id = pandasql.sqldf("SELECT Cust_ID, MIN(Date) FROM bank;")
print(first_id)

   Cust_ID                   MIN(Date)
0      185  2017-04-01 00:00:00.000000

### 8. Создайте любую базу данных в sqlite3, состоящую из 5 колонок, одна из колонок обязательно должна быть типа REAL. (Названия колонок любые, какие захотите)

In [17]:
# CREATING THE TABLE
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened database successfully");

conn.execute('''
CREATE TABLE hosp (Id INTEGER, 
nozology_id INTEGER, 
hospitalization_date DATE, 
Age INTEGER, 
Tbody REAL);''')

conn.commit()

print("Table created successfully");

conn.close()

Opened database successfully
Table created successfully

### 9. Добавьте 3 полностью заполненные строки в вашу БД.

In [18]:
# INSERTING VALUES
conn = sqlite3.connect('test.db')

conn.execute('''INSERT INTO hosp VALUES ('1', '43', '2022-01-06', '51', '37.8'),
                                            ('2', '51', '2022-03-06', '56', '36.8'), 
                                            ('3', '54', '2022-07-06', '26', '36.5');''')

conn.commit()
conn.close()

In [19]:
# проверим, что все добавилось

In [20]:
conn = sqlite3.connect('test.db')
cur = conn.cursor()
cur.execute("SELECT * from hosp;")
result = cur.fetchall()
conn.close()

In [21]:
result

[(1, 43, '2022-01-06', 51, 37.8),
 (2, 51, '2022-03-06', 56, 36.8),
 (3, 54, '2022-07-06', 26, 36.5)]

### 10. Удалите строку из колонки типа REAL (из пункта 8), в которой значение признака среднее (то есть не минимальное и не максимальное). Напрямую указывать значение из этой строки нельзя.

In [22]:
# DELETING VALUES
conn = sqlite3.connect('test.db')

conn.execute('''DELETE FROM hosp WHERE Tbody NOT IN (SELECT MAX(Tbody) FROM hosp) 
                                         and Tbody NOT IN (SELECT MIN(Tbody) FROM hosp);''')

conn.commit()
conn.close()

In [23]:
# проверим, что удалилась именно средняя строка

In [24]:
conn = sqlite3.connect('test.db')
cur = conn.cursor()
cur.execute("SELECT * from hosp;")
result = cur.fetchall()
conn.close()

In [25]:
result

[(1, 43, '2022-01-06', 51, 37.8), (3, 54, '2022-07-06', 26, 36.5)]